# PointElementNonNormalizedCurveParamater Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointElementNonNormalizedCurveParamater Property
ParameterTypeId Class See Also
---
"Non-Normalized Curve Parameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointElementNonNormalizedCurveParamater { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointElementNonNormalizedCurveParamater As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointElementNonNormalizedCurveParamater {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace